GetNZS42031992
Syntax
SapObject.SapModel.Func.FuncRS.GetNZS42031992
VB6 Procedure
Function GetNZS42031992(ByVal Name As String, ByRef NZS4203SF As Double, ByRef NZS4203S As Long, ByRef DampRatio As Double) As Long
Parameters
Name
The name of a NZS4203-1992 response spectrum function.
NZS4203SF
The scaling factor (Sm * Sp * R * Z * L).
NZS4203S
This is 1, 2 or 3, indicating the site subsoil category.
1 = A
2 = B
3 = C
DampRatio
The damping ratio for the function, 0 <= DampRatio < 1.
Remarks
This function retrieves the definition of a NZS4203-1992 response spectrum function.
The function returns zero if the function definition is successfully retrieved; otherwise it returns a nonzero value.
VBA Example
Sub GetRSFuncNZS42031992()
 'dimension variables
 Dim SapObject as cOAPI
 Dim SapModel As cSapModel
 Dim ret As Long
 Dim NZS4203SF As Double
 Dim NZS4203S As Long
 Dim DampRatio As Double
 'create Sap2000 object
 Set SapObject = CreateObject("CSI.SAP2000.API.SapObject")
 'start Sap2000 application
 SapObject.ApplicationStart
 'create SapModel object
 Set SapModel = SapObject.SapModel
 'initialize model
 ret = SapModel.InitializeNewModel
 'create model from template
 ret = SapModel.File.New2DFrame(PortalFrame, 2, 144, 2, 288)
 'add NZS42031992 RS function
 ret = SapModel.Func.FuncRS.SetNZS42031992("RS-1", 1.2, 3, 0.04)
 'get NZS42031992 RS function
 ret = SapModel.Func.FuncRS.GetNZS42031992("RS-1", NZS4203SF, NZS4203S, DampRatio)
 'close Sap2000
 SapObject.ApplicationExit False
 Set SapModel = Nothing
 Set SapObject = Nothing
 End Sub
Release Notes
Initial release in version 11.02.
See Also
SetNZS42031992